In [1]:
#Load Pandas
import pandas as pd

In [2]:
#Create dataframe df1
df1 = pd.DataFrame({'A':['A0','A1','A2','A3'],
                    'B':['B0','B1','B2','B3'],
                    'C':['C0','C1','C2','C3'],
                    'D':['D0','D1','D2','D3']
                   },
                  index = [0,1,2,3])

In [3]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [4]:
#Create dataframe df2
df2 = pd.DataFrame({'A':['A4','A5'],
                    'B':['B4','B5'],
                    'C':['C4','C5'],
                    'D':['D4','D5']
                   },
                  index = [4,5])

In [5]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5

In [6]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [7]:
#Concat example
pd.concat([df1,df2])

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5

In [8]:
concat_df = pd.concat([df1, df2])

In [17]:
df3 = concat_df.drop(['C','D'], axis = 1).drop([3,4,5], axis =0)

In [18]:
df3

    A   B
0  A0  B0
1  A1  B1
2  A2  B2

In [20]:
df4 = pd.DataFrame({'C': ['C0', 'C1', 'C3'],
                    'D': ['D0', 'D1', 'D3']
                   }, index = [0,1,3])

In [21]:
df4

    C   D
0  C0  D0
1  C1  D1
3  C3  D3

In [22]:
#Join Example
df3.join(df4)

    A   B    C    D
0  A0  B0   C0   D0
1  A1  B1   C1   D1
2  A2  B2  NaN  NaN

In [26]:
df4 = pd.DataFrame({'C': ['C0', 'C1', 'C3'],
                    'D': ['D0', 'D1', 'D3'],
                    'B':['B0','B1','B3']
                   }, index = [0,1,3])

In [27]:
df3

    A   B
0  A0  B0
1  A1  B1
2  A2  B2

In [28]:
df4

    C   D   B
0  C0  D0  B0
1  C1  D1  B1
3  C3  D3  B3

In [29]:
pd.merge(df3, df4, on = 'B')

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1

In [ ]:
pd.